In [1]:
train_url = 'https://github.com/sidt-ai/MH-hackathons/blob/main/dare_in_reality_2021/data/raw/train.csv?raw=true'
test_url = 'https://raw.githubusercontent.com/sidt-ai/MH-hackathons/main/dare_in_reality_2021/data/raw/test.csv'
# train_weather_url = 'https://raw.githubusercontent.com/sidt-ai/MH-hackathons/main/dare_in_reality_2021/data/raw/train_weather.csv'
# test_weather_url = 'https://raw.githubusercontent.com/sidt-ai/MH-hackathons/main/dare_in_reality_2021/data/raw/test_weather.csv'

In [2]:
import pandas as pd
import numpy as np
import re

In [3]:
train = pd.read_csv(train_url, skipinitialspace=True)
test = pd.read_csv(test_url, skipinitialspace=True)
# train_weather = pd.read_csv(train_weather_url, skipinitialspace=True)
# test_weather = pd.read_csv(test_weather_url, skipinitialspace=True)

In [6]:
test.head()

   NUMBER  DRIVER_NUMBER  LAP_NUMBER  ...  POWER    LOCATION               EVENT
0      10              1           1  ...    NaN  Location 7  Qualifying Group 1
1      10              1           2  ...  250.0  Location 7  Qualifying Group 1
2      10              1           3  ...  250.0  Location 7  Qualifying Group 1
3      13              1           1  ...    NaN  Location 7  Qualifying Group 1
4      13              1           2  ...  250.0  Location 7  Qualifying Group 1

[5 rows x 25 columns]

In [14]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 420 entries, 0 to 419
Data columns (total 25 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   NUMBER                       420 non-null    int64
 1   DRIVER_NUMBER                420 non-null    int64
 2   LAP_NUMBER                   420 non-null    int64
 3   LAP_TIME                     0 non-null      float64
 4   LAP_IMPROVEMENT              420 non-null    int64
 5   CROSSING_FINISH_LINE_IN_PIT  16 non-null     object
 6   S1                           420 non-null    object
 7   S1_IMPROVEMENT               420 non-null    int64
 8   S2                           420 non-null    object
 9   S2_IMPROVEMENT               420 non-null    int64
 10  S3                           418 non-null    object
 11  S3_IMPROVEMENT               420 non-null    int64
 12  KPH                          418 non-null    float64
 13  ELAPSED                      420 non-null    object
 14  HOUR                         420 non-null    object
 15  S1_LARGE                     420 non-null    object
 16  S2_LARGE                     420 non-null    object
 17  S3_LARGE                     418 non-null    object
 18  DRIVER_NAME                  420 non-null    object
 19  PIT_TIME                     155 non-null    object
 20  GROUP                        391 non-null    float64
 21  TEAM                         420 non-null    object
 22  POWER                        309 non-null    float64
 23  LOCATION                     420 non-null    object
 24  EVENT                        420 non-null    object
dtypes: float64(4), int64(7), object(14)
memory usage: 82.2+ KB

In [33]:
test.loc[test.S3_LARGE.isna()]

     NUMBER  DRIVER_NUMBER  LAP_NUMBER  ...  POWER    LOCATION               EVENT
80       25              1           3  ...    NaN  Location 6  Qualifying Group 1
144      99              1           4  ...    NaN  Location 6  Qualifying Group 3

[2 rows x 25 columns]

In [41]:
train.loc[~train.S3_LARGE.isna() &
          (train.LOCATION == 'Location 6') &
          (train.DRIVER_NAME == 'PWEHRL')]['S3_LARGE']

2708    00:26.0
2709    00:21.5
2710    00:20.4
2711    00:19.9
2712    03:54.4
         ...
8425    00:19.6
8426    00:19.6
8427    00:21.1
8428    00:19.6
8429    00:27.8
Name: S3_LARGE, Length: 62, dtype: object

In [45]:
test.fillna({'PIT_TIME': '00.00.0', 'S3_LARGE': '00:20.0'}, inplace=True)

In [46]:
def to_seconds(t):
  s = str(t)
  parts = list(map(int, re.split('\:|\.', s)))
  return parts[0] * 60 + parts[1] + parts[2] / 10

In [48]:
dummy = pd.DataFrame()
dummy['S1'] = test.S1_LARGE.apply(to_seconds)
dummy['S2'] = test.S2_LARGE.apply(to_seconds)
dummy['S3'] = test.S3_LARGE.apply(to_seconds)
dummy['PIT_TIME'] = test.PIT_TIME.apply(to_seconds)

In [53]:
dummy_submission = pd.DataFrame()
dummy_submission['LAP_TIME'] = dummy.S1 + dummy.S2 + dummy.S3

In [54]:
dummy_submission.head()

   LAP_TIME
0     136.3
1      99.2
2      81.1
3     135.3
4      98.1

In [55]:
dummy_submission.to_csv('dummy_submission.csv', index=False)